TargetApplication=c:\Utils\DebugStringView\DebugStringView.exe
Author=Germán Estévez - Neftalí
SourceLANGID=3082
LANGID=2057
Generator=DKLang Translation Editor v3.0
LastModified=2025-03-31 15:55:24

[FormMain]
00000001=DebugStringView
00000002=Paused
00000003=666 lines
00000004=List of processes (name):
00000005=Process identifiers:
00000013=File
00000014=Opciones de fichero
00000015=Capture
00000016=Opciones de captura de mensajes
00000017=View
00000018=Display options
00000019=Columns
00000020=Display the list of processes by name
00000021=Options
00000022=Other configuration options
00000023=&Font
00000024=A3 Sans Serif
00000025=Cascadia Code
00000026=Courier
00000027=Courier New
00000028=Fira Code
00000029=JetBrains Mono
00000030=Lucida Console
00000031=Monoid
00000032=Source Code Pro
00000033=Terminal
00000034=Other fonts...
00000040=Help
00000041=Opciones de ayuda
00000042=columns
00000043=&Open\n
00000044=Open a file saved by DebugStringView
00000045=Save
00000046=Save screen content
00000047=Save as
00000048=&Exit
00000049=Exit the application
00000050=Date
00000051=Show/Hide the Date Column
00000052=Time
00000053=Show/hide the time column
00000055=Process name
00000056=Message
00000057=Number of line
00000058=Assign a color to each process
00000059=&Autoscroll
00000060=Help
00000061=Help about the program
00000062=About...
00000063=About the app
00000064=Upda&tes
00000065=Check for program updates
00000066=Auto&with columns
00000067=Calculate automatic column widths
00000068=Process list
00000069=List of visible processes
00000070=C&lean debug
00000071=Clear all debug content
00000073=&Pause
00000074=Pause message capture
00000075=&Resume
00000076=Resume message capture
00000077=Log files (*.dsvlog)
00000078=Save the content to a file
00000080=Only &visible messages
00000081=Allows you to record only the messages visible on the screen (filter activated)
00000082=Log files (*.dsvlog)
00000083=Open a log file
00000084=Languages
00000085=Select all processes from the list
00000086=Deselect all processes from the list
00000087=Invert the current process selection
00000089=Check for updates on &start
00000091=Filtered

[FormAcercaDe]
00000001=About...
00000002=DebugStringView
00000003=Version XX.XX
00000005=DebugStringView is an application that allows you to monitor debugging message output on your local computer. It captures messages sent by applications using the OutputDebugString API.
00000008=&Close

[$CONSTANTS]
errcalcularVer=Error checking for new versions of the program.
errDownload=Error downloading file: %s
errMemo=Error, you must assign a [memo] to use this class <%s>
errPath=Error, you must assign a [path] to use this class <%s>
errrestoreConfig1=Error al restaurar la configuración del fichero <%s>
errrestoreConfig2=Please delete it and run the application again.
errSaveConfig1=Error saving configuration to file <%s>.
errSaveConfig2=This may be due to a program error or lack of permissions to write to the file.
err_FilenameNotAssigned=No está asignado el nombre para el fichero de configuración.
err_guardarFichero=Error saving file
err_NoSePuedeBorrar=Error, the file <%s> could not be deleted.
err_Save=Error saving file.
err_SinDatosAsignado=Error, data source <dataset> is not mapped.
LBL_VERSION=Version
msgNewVersion=An update is available <%s>. Click here to go to the download page.
msgNoUpdates=No updates found.
msgUpdatesTitle=Buscar actualizaciones
msg_Activo=Active
msg_Idioma=Change the application language to [%s]
msg_lineas=lines
msg_Pausado=Paused
msg_Updates1=A newer version of the application <%s> has been found.
msg_Updates2=Would you like to open the web page to download it?
str_Filtered=Filtered
title_Fecha=Date
title_hora=Time
title_ID=ID
title_Mensaje=Message
title_Nombre=Name
title_ProcessId=ProcessId
